app/controllers/listings_controller.rb

SELECT "listings".* FROM "listings" ORDER BY listings.created_at DESC
---
  def index()
    @listings = Listing.all.order("listings.created_at DESC")

SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
  def show()
    @listing = Listing.find(params[:id])

SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
---
  def edit()
    set_variables()
    @listing = Listing.find_by_id(params[:id])

INSERT INTO "listings" ("title", "description", "user_id", "condition_id", "category_id", "brand_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
SELECT  "listings".* FROM "listings" WHERE "listings"."user_id" = $1 AND "listings"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def create()
    set_variables()
    @listing = current_user.listings.create(listing_params)
    if @listing.errors.any?

SELECT  "listings".* FROM "listings" WHERE "listings"."user_id" = $1 AND "listings"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 12], ["LIMIT", 1]]
UPDATE "listings" SET "title" = $1, "description" = $2, "brand_id" = $3, "category_id" = $4, "price" = $5, "updated_at" = $6 WHERE "listings"."id" = $7  [["title", "aaabb"], ["description", "lmao"], ["brand_id", 2], ["category_id", 2], ["price", 111], ["updated_at", "2020-05-12 05:53:13.144393"], ["id", 11]]
---
  def update()
    @listing = current_user.listings.find_by_id(params[:id])
    set_variables()

    if @listing
      @listing.update(listing_params)

SELECT  "listings".* FROM "listings" WHERE "listings"."user_id" = $1 AND "listings"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 11], ["LIMIT", 1]]
DELETE FROM "listings" WHERE "listings"."id" = $1  [["id", 11]]
---
  def destroy()
    @listing = current_user.listings.find_by_id(params[:id])

    if @listing
      @listing.destroy

SELECT "brands".* FROM "brands"
SELECT "categories".* FROM "categories"
SELECT "conditions".* FROM "conditions"
---
  def set_variables()
    @brand = Brand.all
    @clothing_category = Category.all
    @condition = Condition.all

SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
  def set_listing()
    @listing = Listing.find(params[:id])

SELECT  "listings".* FROM "listings" WHERE "listings"."user_id" = $1 AND "listings"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 10], ["LIMIT", 1]]
---
  def set_user_listing()
    @listing = current_user.listings.find_by_id(params[:id])