app/controllers/listings_controller.rb

  def set_listing()
    @listing = Listing.find(params[:id])
---
SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]